coon42legacy/FloppyOrgelEmulator/FloppyOrgelSystem/hal/hal_misc_stm32f4.c
#include <stdint.h>
#include <stdio.h>
#include <stdarg.h>
#include "stm32f4xx.h"
#include "hal_misc.h"

uint32_t hal_clock() {
  return TIM5->CNT / 1000;
}

static void _print(const char* text) {
  printf("%s\n\r", text);
}

void hal_printf(char* format, ...) {
  char formattedText[512];

  va_list args;
  va_start(args, format);
  vsnprintf(formattedText, sizeof(formattedText), format, args);
  _print(formattedText);
  va_end(args);
}

void hal_printfError(const char* format, ...) {
  char formattedText[512];

  va_list args;
  va_start(args, format);
  vsnprintf(formattedText, sizeof(formattedText), format, args);
  _print(formattedText);
  va_end(args);
}

void hal_printfWarning(char* format, ...) {
  char formattedText[512];

  va_list args;
  va_start(args, format);
  vsnprintf(formattedText, sizeof(formattedText), format, args);
  _print(formattedText);
  va_end(args);
}

void hal_printfSuccess(char* format, ...) {
  char formattedText[512];

  va_list args;
  va_start(args, format);
  vsnprintf(formattedText, sizeof(formattedText), format, args);
  _print(formattedText);
  va_end(args);
}

void hal_printfInfo(char* format, ...) {
  char formattedText[512];

  va_list args;
  va_start(args, format);
  vsnprintf(formattedText, sizeof(formattedText), format, args);
  _print(formattedText);
  va_end(args);
}
